slra/slra.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>SLRA: Software for weighted structured low-rank approximation</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="SLRA: Software for weighted structured low-rank approximation"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-02-19 11:30:25 CET"/>
<meta name="author" content="Ivan Markovsky and Konstantin Usevich\\ Vrije Universiteit Brussel"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">SLRA: Software for weighted structured low-rank approximation</h1>

<p>The package computes locally optimal solutions to low-rank approximation problems 
\[
minimize \ over \widehat D
\]
with the following features:
</p><ul>
<li>mosaic Hankel structure constraint on the approximating matrix,
</li>
<li>weighted 2-norm approximation criterion,
</li>
<li>fixed elements in the approximating matrix,
</li>
<li>missing elements in the data matrix, and
</li>
<li>linear constraints on an approximating matrix's left kernel basis.
</li>
</ul>

<p>For an \(m\times n\) data matrix, with \(m &lt; n\), the computational complexity of the cost function and derivative evaluation is \(O(m^2n)\), so that the package is suitable for applications with \(n\gg m\).
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Documentation [??]</a></li>
<li><a href="#sec-2">2 Download</a></li>
<li><a href="#sec-3">3 Licencing</a></li>
<li><a href="#sec-4">4 Citing</a></li>
<li><a href="#sec-5">5 Feedback</a></li>
<li><a href="#sec-6">6 Version history</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-3">
<h3 id="sec-1"><span class="section-number-3">1</span> Documentation [??]</h3>
<div class="outline-text-3" id="text-1">


</div>

</div>

<div id="outline-container-2" class="outline-3">
<h3 id="sec-2"><span class="section-number-3">2</span> Download</h3>
<div class="outline-text-3" id="text-2">

<ul>
<li>precompiled mex files for 64 bit Linux, Windows, and Mac OS [slra.tgz] 
</li>
<li>source code <a href="https://github.com/slra/slra">https://github.com/slra/slra</a> Software for structured low-rank approximation
</li>
</ul>


</div>

</div>

<div id="outline-container-3" class="outline-3">
<h3 id="sec-3"><span class="section-number-3">3</span> Licencing</h3>
<div class="outline-text-3" id="text-3">


</div>

</div>

<div id="outline-container-4" class="outline-3">
<h3 id="sec-4"><span class="section-number-3">4</span> Citing</h3>
<div class="outline-text-3" id="text-4">


</div>

</div>

<div id="outline-container-5" class="outline-3">
<h3 id="sec-5"><span class="section-number-3">5</span> Feedback</h3>
<div class="outline-text-3" id="text-5">


</div>

</div>

<div id="outline-container-6" class="outline-3">
<h3 id="sec-6"><span class="section-number-3">6</span> Version history</h3>
<div class="outline-text-3" id="text-6">

<ul>
<li>
</li>
</ul>


</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2013-02-19 11:30:25 CET</p>
<p class="author">Author: Ivan Markovsky and Konstantin Usevich\\ Vrije Universiteit Brussel</p>
<p class="creator">Org version 7.8.11 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
